yoann-darche/micropython/ports/esp32/machine_pwm.c
    self->duty_x = HIGHEST_PWM_RES;
    self->duty_u16 = duty;
}

static void set_duty_u10(machine_pwm_obj_t *self, int duty) {
    pwm_is_active(self);
    if ((duty < 0) || (duty > MAX_DUTY_U10)) {
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("duty must be from 0 to %u"), MAX_DUTY_U10);
    }
    set_duty_u16(self, duty << (UI_RES_16_BIT - PWM_RES_10_BIT));
    self->duty_x = PWM_RES_10_BIT;
    self->duty_u10 = duty;
}

static void set_duty_ns(machine_pwm_obj_t *self, int ns) {
    pwm_is_active(self);
    if ((ns < 0) || (ns > duty_to_ns(self, UI_MAX_DUTY))) {
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("duty_ns must be from 0 to %d ns"), duty_to_ns(self, UI_MAX_DUTY));
    }
    set_duty_u16(self, ns_to_duty(self, ns));
    self->duty_x = -HIGHEST_PWM_RES;
    self->duty_ns = ns;
}

/******************************************************************************/

#define SAME_FREQ_ONLY (true)
#define SAME_FREQ_OR_FREE (false)
#define ANY_MODE (-1)

// Return timer_idx. Use TIMER_IDX_TO_MODE(timer_idx) and TIMER_IDX_TO_TIMER(timer_idx) to get mode and timer
static int find_timer(unsigned int freq, bool same_freq_only, int mode) {
    int free_timer_idx_found = -1;
    // Find a free PWM Timer using the same freq
    for (int timer_idx = 0; timer_idx < PWM_TIMER_MAX; ++timer_idx) {
        if ((mode == ANY_MODE) || (mode == TIMER_IDX_TO_MODE(timer_idx))) {
            if (timers[timer_idx].freq_hz == freq) {
                // A timer already uses the same freq. Use it now.
                return timer_idx;
            }
            if (!same_freq_only && (free_timer_idx_found == -1) && (timers[timer_idx].freq_hz == -1)) {
                free_timer_idx_found = timer_idx;
                // Continue to check if a channel with the same freq is in use.
            }
        }
    }

    return free_timer_idx_found;
}

// Return true if the timer is in use in addition to current channel
static bool is_timer_in_use(int current_channel_idx, int timer_idx) {
    for (int i = 0; i < PWM_CHANNEL_MAX; ++i) {
        if ((i != current_channel_idx) && (chans[i].timer_idx == timer_idx)) {
            return true;
        }
    }

    return false;
}

#if !(PWM_SUPPORT_INDEP_CLOCK_SRC)
// Check if a timer is already set with a different clock source
static int is_timer_with_different_clock(int current_timer_idx, ledc_clk_cfg_t ref_clk_src) {
    for (int i = 0; i < PWM_TIMER_MAX; i++) {
        if ((i != current_timer_idx) && (timers[i].clk_cfg != LEDC_AUTO_CLK) && (timers[i].clk_cfg != ref_clk_src)) {
            return true;
        }
    }

    return false;
}

// This check if a clock is already set in the timer list, if yes, return the PWM_XXX_CLK value
static int find_clock_in_use() {

    ledc_clk_cfg_t found_clk = LEDC_AUTO_CLK;

    for (int i = 0; i < PWM_TIMER_MAX; i++) {
        if (timers[i].clk_cfg != LEDC_AUTO_CLK) {
            found_clk = timers[i].clk_cfg;
            break;
        }
    }

    if (found_clk == LEDC_AUTO_CLK) {
        return PWM_AUTO_CLK;
    }
    #if SOC_LEDC_SUPPORT_APB_CLOCK
    else if (found_clk == LEDC_USE_APB_CLK) {
        return PWM_APB_CLK;
    }
    #endif
    else if (found_clk == LEDC_USE_RC_FAST_CLK) {
        return PWM_RC_FAST_CLK;
    }
    #if SOC_LEDC_SUPPORT_REF_TICK
    else if (found_clk == LEDC_USE_REF_TICK) {
        return PWM_REF_TICK;
    }
    #endif
    #if SOC_LEDC_SUPPORT_XTAL_CLOCK
    else if (found_clk == LEDC_USE_XTAL_CLK) {
        return PWM_XTAL_CLK;
    }
    #endif
    #if SOC_LEDC_SUPPORT_PLL_DIV_CLOCK
    else if (found_clk == LEDC_USE_PLL_DIV_CLK) {
        return PWM_PLL_CLK;
    }
    #endif

    return PWM_AUTO_CLK;
}

#endif

// Find a free PWM channel, also spot if our pin is already mentioned.
// Return channel_idx. Use CHANNEL_IDX_TO_MODE(channel_idx) and CHANNEL_IDX_TO_CHANNEL(channel_idx) to get mode and channel
static int find_channel(int pin, int mode) {
    int avail_idx = -1;
    int channel_idx;
    for (channel_idx = 0; channel_idx < PWM_CHANNEL_MAX; ++channel_idx) {
        if ((mode == ANY_MODE) || (mode == CHANNEL_IDX_TO_MODE(channel_idx))) {
            if (chans[channel_idx].pin == pin) {
                break;
            }
            if ((avail_idx == -1) && (chans[channel_idx].pin == -1)) {
                avail_idx = channel_idx;
            }
        }
    }
    if (channel_idx >= PWM_CHANNEL_MAX) {
        channel_idx = avail_idx;
    }
    return channel_idx;
}

/******************************************************************************/
// MicroPython bindings for PWM

static void mp_machine_pwm_print(const mp_print_t *print, mp_obj_t self_in, mp_print_kind_t kind) {
    machine_pwm_obj_t *self = MP_OBJ_TO_PTR(self_in);
    mp_printf(print, "PWM(Pin(%u)", self->pin);
    if (self->active) {
        mp_printf(print, ", freq=%u", ledc_get_freq(self->mode, self->timer));

        if (self->duty_x == PWM_RES_10_BIT) {
            mp_printf(print, ", duty=%d", get_duty_u10(self));
        } else if (self->duty_x == -HIGHEST_PWM_RES) {
            mp_printf(print, ", duty_ns=%d", get_duty_ns(self));
        } else {
            mp_printf(print, ", duty_u16=%d", get_duty_u16(self));
        }
        int resolution = timers[TIMER_IDX(self->mode, self->timer)].duty_resolution;
        mp_printf(print, ", resolution=%d", resolution);

        mp_printf(print, ", (duty=%.2f%%, resolution=%.3f%%)", 100.0 * get_duty_raw(self) / (1 << resolution), 100.0 * 1 / (1 << resolution)); // percents

        mp_printf(print, ", mode=%d, channel=%d, timer=%d", self->mode, self->channel, self->timer);

        int clk_src = timers[TIMER_IDX(self->mode, self->timer)].clk_cfg;
        if (clk_src == LEDC_USE_RC_FAST_CLK) {
            mp_printf(print, ", clock=PWM_RC_FAST_CLK(%d)", PWM_RC_FAST_CLK);
        }
        #if SOC_LEDC_SUPPORT_APB_CLOCK
        else if (clk_src == LEDC_USE_APB_CLK) {
            mp_printf(print, ", clock=PWM_APB_CLK(%d)", PWM_APB_CLK);
        }
        #endif
        #if SOC_LEDC_SUPPORT_XTAL_CLOCK
        else if (clk_src == LEDC_USE_XTAL_CLK) {
            mp_printf(print, ", clock=PWM_XTAL_CLK(%d)", PWM_XTAL_CLK);
        }
        #endif
        #if SOC_LEDC_SUPPORT_REF_TICK
        else if (clk_src == LEDC_USE_REF_TICK) {
            mp_printf(print, ", clock=PWM_REF_TICK(%d)", PWM_REF_TICK);
        }
        #endif
        #if SOC_LEDC_SUPPORT_PLL_DIV_CLOCK
        else if (clk_src == LEDC_USE_PLL_DIV_CLK) {
            mp_printf(print, ", clock=PWM_PLL_CLK(%d)", PWM_PLL_CLK);
        }
        #endif
        else {
            mp_printf(print, ", clock=UNKNOWN");
        }

        if (self->lightsleepenabled) {
            mp_printf(print, ", light sleep enabled");
        }
    }
    mp_printf(print, ")");
}

// This called from pwm.init() method
static void mp_machine_pwm_init_helper(machine_pwm_obj_t *self,
    size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    enum { ARG_freq, ARG_duty, ARG_duty_u16, ARG_duty_ns };
    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_freq, MP_ARG_INT, {.u_int = -1} },
        { MP_QSTR_duty, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = -1} },
        { MP_QSTR_duty_u16, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = -1} },
        { MP_QSTR_duty_ns, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = -1} },
    };
    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_args, pos_args, kw_args,
        MP_ARRAY_SIZE(allowed_args), allowed_args, args);

    int freq = args[ARG_freq].u_int;

    // ***************************** Decode clok and light sleep mode *********************************
    int pwm_src_clock = args[ARG_clock].u_int;
    if (pwm_src_clock >= _PWM_LAST_CLK_IDX) {
        mp_raise_ValueError(MP_ERROR_TEXT("Bad value for clock."));
    }

