yoann-darche/micropython/ports/esp32/machine_pwm.c
    // Check if the clock is available:
    if (clk_source_map[pwm_src_clock] < 0) {
        mp_raise_ValueError(MP_ERROR_TEXT("Clock source not available for this Soc."));
    }

    if (args[ARG_lightSleepEnable].u_int > 0) {
        // The light sleep enabled is requested
        // => GPIO need to be in the not disabled list

        if (pwm_src_clock == PWM_AUTO_CLK) {
            // In case of Clock auto select, with sleep mode the clock will be PWM_RC_FAST_CLK
            pwm_src_clock = PWM_RC_FAST_CLK;
        }
        // Check if the source clock is valid for light sleep (only LEDC_USE_RC_FAST_CLK is valid )
        else if (pwm_src_clock != PWM_RC_FAST_CLK) {
            mp_raise_ValueError(MP_ERROR_TEXT("only PWM_RC_FAST_CLK is allowed with light sleep enabled"));
        }
        self->lightsleepenabled = true;

    } else {
        self->lightsleepenabled = false;
    }

    // if auto clock => Determine the best clock
    if (pwm_src_clock == PWM_AUTO_CLK) {

        #if !(PWM_SUPPORT_INDEP_CLOCK_SRC)
        int pwm_clk = find_clock_in_use();
        if (pwm_clk != PWM_AUTO_CLK) {
            pwm_src_clock = pwm_clk;
        } else {
            #if SOC_LEDC_SUPPORT_PLL_DIV_CLOCK
            pwm_src_clock = PWM_PLL_CLK;
            #endif
            #if SOC_LEDC_SUPPORT_APB_CLOCK
            pwm_src_clock = PWM_APB_CLK;
            #endif
        }
        #else
        #if SOC_LEDC_SUPPORT_PLL_DIV_CLOCK
        pwm_src_clock = PWM_PLL_CLK;
        #endif
        #if SOC_LEDC_SUPPORT_APB_CLOCK
        pwm_src_clock = PWM_APB_CLK;
        #endif

        #if SOC_LEDC_SUPPORT_REF_TICK
        if (freq < EMPIRIC_FREQ) {
            pwm_src_clock = PWM_REF_TICK;         // 1 MHz
        }
        #endif
        #endif
    }
    #if !(PWM_SUPPORT_INDEP_CLOCK_SRC)
    else {
        int pwm_clk = find_clock_in_use();
        if ((pwm_clk != PWM_AUTO_CLK) && (pwm_clk != pwm_src_clock)) {
            mp_raise_ValueError(MP_ERROR_TEXT("one or more active timers use a different clock source, not supported by the current SoC."));
        }
    }
    #endif


    // Note: High Speed Mode (available on ESP32 only, not on S2/S3), only supports REF_TICK(1MHz) and APB_CLK(80MHz)
    //       Low Speed Mode  (avail. on ESP32, S2, S3, C3, C6) supports [REF_TICK(1MHz)], RC_FAST_CLK(8Mhz) and APB_CLK(80MHz)

    int channel_idx = (self->lightsleepenabled) ? find_channel(self->pin, 0) : find_channel(self->pin, ANY_MODE);

    if (channel_idx == -1) {
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("out of PWM channels:%d"), PWM_CHANNEL_MAX); // in all modes
    }

    int duty = args[ARG_duty].u_int;
    int duty_u16 = args[ARG_duty_u16].u_int;
    int duty_ns = args[ARG_duty_ns].u_int;
    if (((duty != -1) && (duty_u16 != -1)) || ((duty != -1) && (duty_ns != -1)) || ((duty_u16 != -1) && (duty_ns != -1))) {
        mp_raise_ValueError(MP_ERROR_TEXT("only one of parameters 'duty', 'duty_u16' or 'duty_ns' is allowed"));
    }

    int freq = args[ARG_freq].u_int;
    // Check if freq wasn't passed as an argument
    if (freq == -1) {
        // Check if already set, otherwise use the default freq.
        // It is possible in case:
        // pwm = PWM(pin, freq=1000, duty=256)
        // pwm = PWM(pin, duty=128)
        if (chans[channel_idx].timer_idx != -1) {
            freq = timers[chans[channel_idx].timer_idx].freq_hz;
        }
        if (freq <= 0) {
            freq = PWM_FREQ;
        }
    }
    if ((freq <= 0) || (freq > 40000000)) {
        mp_raise_ValueError(MP_ERROR_TEXT("frequency must be from 1Hz to 40MHz"));
    }

    int timer_idx;
    int current_timer_idx = chans[channel_idx].timer_idx;
    bool current_in_use = is_timer_in_use(channel_idx, current_timer_idx);
    if (current_in_use) {
        timer_idx = find_timer(freq, SAME_FREQ_OR_FREE, CHANNEL_IDX_TO_MODE(channel_idx));
    } else {
        timer_idx = chans[channel_idx].timer_idx;
    }

    if (timer_idx == -1) {
        timer_idx = find_timer(freq, SAME_FREQ_OR_FREE, ANY_MODE);
    }
    if (timer_idx == -1) {
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("out of PWM timers:%d"), PWM_TIMER_MAX); // in all modes
    }

    int mode = TIMER_IDX_TO_MODE(timer_idx);
    if (CHANNEL_IDX_TO_MODE(channel_idx) != mode) {
        // unregister old channel
        chans[channel_idx].pin = -1;
        chans[channel_idx].timer_idx = -1;
        // find new channel
        channel_idx = find_channel(self->pin, mode);
        if (CHANNEL_IDX_TO_MODE(channel_idx) != mode) {
            mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("out of PWM channels:%d"), PWM_CHANNEL_MAX); // in current mode
        }
    }
    self->mode = mode;
    self->timer = TIMER_IDX_TO_TIMER(timer_idx);
    self->channel = CHANNEL_IDX_TO_CHANNEL(channel_idx);

    // New PWM assignment
    if ((chans[channel_idx].pin == -1) || (chans[channel_idx].timer_idx != timer_idx)) {
        configure_channel(self);
        chans[channel_idx].pin = self->pin;
    }
    chans[channel_idx].timer_idx = timer_idx;
    self->active = true;

    // Set timer frequency
    set_freq(self, freq, &timers[timer_idx]);

    // Set duty cycle?
    if (duty_u16 != -1) {
        set_duty_u16(self, duty_u16);
    } else if (duty_ns != -1) {
        set_duty_ns(self, duty_ns);
    } else if (duty != -1) {
        set_duty_u10(self, duty);
    } else if (self->duty_x == 0) {
        set_duty_u10(self, (1 << PWM_RES_10_BIT) / 2); // 50%
    }
}

// This called from PWM() constructor
static mp_obj_t mp_machine_pwm_make_new(const mp_obj_type_t *type,
    size_t n_args, size_t n_kw, const mp_obj_t *args) {
    mp_arg_check_num(n_args, n_kw, 1, 2, true);
    gpio_num_t pin_id = machine_pin_get_id(args[0]);

    // create PWM object from the given pin
    machine_pwm_obj_t *self = mp_obj_malloc(machine_pwm_obj_t, &machine_pwm_type);
    self->pin = pin_id;
    self->active = false;
    self->mode = -1;
    self->channel = -1;
    self->timer = -1;
    self->duty_x = 0;

    // start the PWM subsystem if it's not already running
    if (!pwm_inited) {
        pwm_init();
        pwm_inited = true;
    }

    // start the PWM running for this channel
    mp_map_t kw_args;
    mp_map_init_fixed_table(&kw_args, n_kw, args + n_args);
    mp_machine_pwm_init_helper(self, n_args - 1, args + 1, &kw_args);

